<a href="https://colab.research.google.com/github/Shikhas/Data-Preparation-and-Analysis/blob/master/Alcohol_consumption_analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Alcohol Consumption by Country**

In [2]:
import pandas as pd 
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv' 
drinks = pd.read_csv(url)
drinks.head(5)

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0         AS
1      Albania             89  ...                           4.9         EU
2      Algeria             25  ...                           0.7         AF
3      Andorra            245  ...                          12.4         EU
4       Angola            217  ...                           5.9         AF

[5 rows x 6 columns]

In [3]:
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [4]:
# continent drinking more average beer or more beer on avaerage

con = drinks.groupby("continent").beer_servings.mean() # when we want mean of only one column but grouped continent wise

In [6]:
con.head()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

In [9]:
wine_data = drinks.groupby("continent").wine_servings # statistics for wine consumption, continent wise

In [12]:
wine_data.describe() # when we want not only mean but all stats

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [13]:
drinks.groupby("continent").mean() #continent wise mean of every column

           beer_servings  ...  total_litres_of_pure_alcohol
continent                 ...
AF             61.471698  ...                      3.007547
AS             37.045455  ...                      2.170455
EU            193.777778  ...                      8.617778
OC             89.687500  ...                      3.381250
SA            175.083333  ...                      6.308333

[5 rows x 4 columns]

In [14]:
drinks.groupby("continent").median() #continent wise median of every column

           beer_servings  ...  total_litres_of_pure_alcohol
continent                 ...
AF                  32.0  ...                          2.30
AS                  17.5  ...                          1.20
EU                 219.0  ...                         10.00
OC                  52.5  ...                          1.75
SA                 162.5  ...                          6.85

[5 rows x 4 columns]

In [17]:
# continent wise mean, min, max for spirit consumption 
drinks.groupby("continent").spirit_servings.agg(['mean', 'min', 'max']) # when we want multiple specific aggr function on one column

                 mean  min  max
continent
AF          16.339623    0  152
AS          60.840909    0  326
EU         132.555556    0  373
OC          58.437500    0  254
SA         114.750000   25  302